import LabelModule from "../../../modules/LabelModule/labelModule";

function ConfPage() {
    return ( 
        <>
        <div>
            <LabelModule
            title="Политика конфиденциальности для интернет-магазина игр Cyber-Butik"
            text={`Настоящая Политика конфиденциальности (далее — Политика) регулирует порядок сбора, использования, хранения и раскрытия информации, полученной от пользователей (далее — Пользователь) интернет-магазина игр Cyber-Butik (далее — Магазин).
            `}
            text2={`1. Сбор информации

            1.1. Мы собираем персональную информацию, которую Пользователь предоставляет при регистрации на сайте, оформлении заказа, подписке на новости или при обращении в службу поддержки. Эта информация может включать:
            
            Имя и фамилию;
            Адрес электронной почты;
            Номер телефона;
            Почтовый адрес;
            Платежные данные (не хранятся в системе Магазина).
            1.2. Мы также можем собирать информацию автоматически при посещении сайта, такую как:
            
            IP-адрес;
            Тип браузера и операционной системы;
            История посещений страниц сайта;
            Файлы cookies и другие аналогичные технологии.
            `}
            text3={`2. Использование информации

            2.1. Собранная информация используется для следующих целей:
            
            Обработка и выполнение заказов;
            Обеспечение персонализированного обслуживания;
            Улучшение работы сайта и услуг Магазина;
            Связь с Пользователем для уведомлений о статусе заказа, специальных предложениях и акциях;
            Обработка запросов и обращений Пользователей.
            `}
            text4={`3. Защита информации

            3.1. Мы принимаем все необходимые меры для защиты персональной информации Пользователя от несанкционированного доступа, изменения, раскрытия или уничтожения.
            3.2. Мы используем защищенные серверы и шифрование данных для обеспечения безопасности платежей и персональных данных.
            `}
            text5={`4. Раскрытие информации третьим лицам

            4.1. Мы не продаем, не обмениваем и не передаем персональную информацию Пользователя третьим лицам без его согласия, за исключением следующих случаев:
            
            При выполнении требований закона;
            При защите наших прав и собственности;
            При необходимости выполнения заказа (например, передача данных службе доставки).
            `}
            text6={`5. Файлы cookies

            5.1. Мы используем файлы cookies для улучшения работы сайта и предоставления персонализированного опыта Пользователю.
            5.2. Пользователь может настроить свой браузер для отказа от использования файлов cookies, однако это может ограничить доступ к некоторым функциям сайта.
            `}
            text7={`6. Ссылки на сторонние сайты

            6.1. На нашем сайте могут быть ссылки на сторонние сайты, которые имеют свои собственные политики конфиденциальности. Мы не несем ответственности за содержание и методы работы таких сайтов.
            `}
            text8={`7. Права Пользователя

            7.1. Пользователь имеет право:
            
            Запрашивать информацию о своих персональных данных, которые хранятся в Магазине;
            Требовать исправления неточных данных;
            Требовать удаления своих персональных данных, за исключением случаев, когда их хранение необходимо по закону;
            Отказаться от получения рекламных рассылок.
            `}
            text9={`8. Изменения в Политике

            8.1. Мы оставляем за собой право вносить изменения в настоящую Политику в любое время. Изменения вступают в силу с момента их публикации на сайте.
            8.2. Рекомендуем периодически проверять Политику для ознакомления с актуальными изменениями.
            `}
            text10={`9. Контактная информация

            Если у вас есть вопросы или пожелания по поводу настоящей Политики конфиденциальности, пожалуйста, свяжитесь с нами:
            
            Электронная почта: privacy@cyber-butik.com
            Телефон: +7 (800) 123-45-67
            Адрес: ул. Геймеров, 25, Москва, Россия
            Благодарим за доверие к Cyber-Butik и надеемся, что ваше пребывание на нашем сайте будет приятным и безопасным.
            `}
            />
        </div>  
        </>
     );
}

export default ConfPage;