import LabelModule from "../../../modules/LabelModule/labelModule";

function UserConfirmPage () {
    return (  
        <>
        <div>
            <LabelModule
            title="Пользовательское соглашение для интернет-магазина игр Cyber-Butik"
            text={`Настоящее Пользовательское соглашение (далее — Соглашение) регулирует отношения между интернет-магазином игр Cyber-Butik (далее — Магазин) и пользователями его услуг (далее — Пользователь).
            `}
            text2={`1. Общие положения

            1.1. Использование услуг Магазина означает согласие Пользователя с настоящим Соглашением.
            1.2. Соглашение может быть изменено Магазином без какого-либо специального уведомления Пользователя. Новая редакция Соглашения вступает в силу с момента ее размещения на сайте Магазина.
            1.3. Использование сайта после внесения изменений означает автоматическое принятие Пользователем изменений.
            `}
            text3={`2. Регистрация на сайте

            2.1. Для использования всех возможностей Магазина Пользователю необходимо пройти процедуру регистрации, предоставив достоверную и полную информацию о себе.
            2.2. Пользователь обязуется поддерживать актуальность данных, предоставленных при регистрации.
            2.3. Магазин оставляет за собой право отказать в регистрации без объяснения причин.
            `}
            text4={`3. Персональные данные

            3.1. Магазин обязуется обеспечивать конфиденциальность и безопасность персональных данных Пользователя.
            3.2. Персональные данные Пользователя используются исключительно для выполнения его заказов и улучшения качества обслуживания.
            `}
            text5={`4. Оформление и выполнение заказов

            4.1. Пользователь может оформить заказ на сайте Магазина, выбрав интересующий его товар и заполнив все необходимые поля.
            4.2. Оплата заказа возможна различными способами, указанными на сайте Магазина.
            4.3. Доставка товара осуществляется в соответствии с выбранным способом доставки. Сроки доставки зависят от региона и условий доставки.
            4.4. Магазин не несет ответственности за задержки в доставке по вине третьих лиц.
            `}
            text6={`5. Возврат и обмен товаров

            5.1. Условия возврата и обмена товаров регулируются Политикой возврата, размещенной на сайте Магазина.
            5.2. Возврат и обмен товаров возможен в течение 14 дней с момента получения при соблюдении условий Политики возврата.
            `}
            text7={`6. Обязанности и права сторон

            6.1. Пользователь обязуется:
            
            Не использовать услуги Магазина в противоправных целях.
            Соблюдать условия настоящего Соглашения.
            Предоставлять достоверную информацию при регистрации и оформлении заказов.
            6.2. Магазин обязуется:
            
            Обеспечить доступность услуг в соответствии с условиями настоящего Соглашения.
            Обеспечивать конфиденциальность персональных данных Пользователя.
            Обрабатывать заказы в сроки, установленные на сайте Магазина.
            6.3. Магазин имеет право:
            
            Временно приостановить доступ к сайту для проведения технических работ.
            Изменять ассортимент и стоимость товаров.
            Отказать в обслуживании Пользователю в случае нарушения им условий Соглашения.
            `}
            text8={`7. Ответственность сторон

            7.1. Магазин не несет ответственности за убытки, понесенные Пользователем в результате использования или невозможности использования услуг Магазина.
            7.2. Пользователь несет ответственность за достоверность предоставленной информации и действия, совершенные на сайте под его учетной записью.
            `}
            text9={`8. Разрешение споров

            8.1. Все споры и разногласия, возникающие из настоящего Соглашения, решаются путем переговоров между сторонами.
            8.2. В случае невозможности урегулирования спора путем переговоров, спор подлежит рассмотрению в суде по месту нахождения Магазина.
            `}
            text10={`9. Прочие условия

            9.1. Настоящее Соглашение вступает в силу с момента акцепта Пользователем и действует до момента его расторжения.
            9.2. Пользователь имеет право в любое время расторгнуть настоящее Соглашение путем прекращения использования услуг Магазина.
            `}
            text11={`Контактная информация

            Электронная почта: support@cyber-butik.com
            Телефон: +7 (800) 123-45-67
            Адрес: ул. Геймеров, 25, Москва, Россия
            Благодарим за выбор Cyber-Butik!
            `}
            />
        </div>
        </>
    );
}

export default UserConfirmPage;